{
  "about": "I'm a cybersecurity student passionate about ethical hacking, penetration testing, and securing digital infrastructure. My journey into security began with competitive CTF challenges and has evolved into hands-on research and tool development. I specialize in web application security, network penetration testing, and binary exploitation. Currently seeking opportunities to contribute to the security community while continuing to expand my knowledge in offensive security and vulnerability research.",
  
  "skills": [
    "Penetration Testing",
    "Network Security",
    "Binary Exploitation",
    "Reverse Engineering",
    "Cryptography",
    "Linux System Administration",
    "Python Development",
    "Bash Scripting",
    "C/C++",
    "Assembly",
    "JavaScript",
    "Metasploit Framework",
    "Burp Suite Professional",
    "Wireshark",
    "Nmap/Nessus",
    "IDA Pro/Ghidra",
    "SQLMap",
    "John the Ripper",
    "Aircrack-ng",
    "Docker/Kubernetes",
    "OSINT Techniques",
    "Digital Forensics",
    "Malware Analysis"
  ],
  
  "projects": [
    {
      "title": "Secure Netra",
      "description": "Engineered a full-stack, secure NVR platform to protect CCTV infrastructure using a React-based SOC dashboard and a Node.js backend. Implemented a multi-layered defense with a real-time IDS/IPS, Role-Based Access Control (RBAC), and end-to-end TLS encryption.",
      "link": "https://github.com/UnDeadBandit/Cyber-Challenge-CCTV-Cyber-Warriors.git"
    },
    {
      "title": "Honeytrack",
      "description": "Deployed a Cowrie SSH/Telnet honeypot on a public Raspberry Pi to capture real-world attacker data. Securely pipelined logs to a centralized ELK Stack, creating Kibana dashboards to analyze and visualize attacker TTPs (Tactics, Techniques, and Procedures).",
      "link": "https://github.com/HoneyTrack/HoneyTrack-SSH.git"
    },
    {
      "title": "LinuxAdmin",
      "description": "Engineered a security monitoring platform by deploying and integrating industry-standard open-source tools. Deployed Wazuh (XDR/SIEM) for real-time threat detection and integrated MeshCentral for secure, role-based remote administration of Linux endpoints.",
      "link": "confidential"
    }
  ],
  
  "ctf": [
    {
      "event": "PicoCTF 2024",
      "rank": "Top 100 Globally",
      "date": "March 2024",
      "description": "Achieved top 100 ranking among 10,000+ participants. Solved 45+ challenges across cryptography, binary exploitation, reverse engineering, web exploitation, and forensics categories. Specialized in advanced binary pwn and crypto challenges."
    },
    {
      "event": "HTB University CTF 2023",
      "rank": "5th Place (Team)",
      "date": "December 2023",
      "description": "Competed as part of a 4-member team in university CTF focusing on real-world penetration testing scenarios. Personally contributed to 8 machine compromises and full domain takeover. Led the privilege escalation efforts."
    },
    {
      "event": "CyberDefenders Blue Team Challenge",
      "rank": "Top 50",
      "date": "October 2023",
      "description": "Participated in defensive security challenges focusing on digital forensics, incident response, and threat hunting. Analyzed compromised systems, identified attack vectors, and reconstructed timeline of security incidents."
    },
    {
      "event": "Google CTF 2023",
      "rank": "Participant",
      "date": "June 2023",
      "description": "Solved multiple challenges in web security and reverse engineering categories. Gained experience with advanced exploitation techniques and security research methodologies."
    },
    {
      "event": "DEF CON 31 CTF Qualifier",
      "rank": "Qualifier Participant",
      "date": "May 2023",
      "description": "Competed in one of the most challenging CTFs globally. Focused on binary exploitation and reverse engineering challenges. Learned advanced techniques from top security researchers."
    }
  ],
  
  "articles": [
    {
      "title": "AI on the Case: Revolutionizing Cyber Crime Investigation",
      "date": "Oct 16, 2025",
      "readTime": "12 min read",
      "excerpt": " The future of cybercrime investigation lies not in replacing human intuition, but in forging a powerful partnership between investigator and machin, a collaboration poised to redefine digital justice.",
      "link": "./articles/article2.html"
    }

  ],
  
  "videos": [
    {
      "title": "Full Web Application Penetration Test Walkthrough",
      "url": "videos/webapp-pentest-demo.mp4",
      "description": "Complete demonstration of testing a vulnerable web application from reconnaissance to post-exploitation. Covers OWASP Top 10 vulnerabilities including SQL injection, XSS, CSRF, and authentication bypasses. Runtime: 25 minutes."
    },
    {
      "title": "Network Traffic Analysis with Wireshark",
      "url": "videos/wireshark-analysis.mp4",
      "description": "In-depth tutorial on capturing and analyzing network packets to identify suspicious activity and potential security breaches. Includes real-world examples of detecting port scans, password sniffing, and malware communication. Runtime: 18 minutes."
    },
    {
      "title": "CTF Writeup: Advanced Binary Exploitation Challenge",
      "url": "videos/ctf-binary-exploitation.mp4",
      "description": "Step-by-step solution to a challenging CTF reverse engineering and binary exploitation problem. Demonstrates dynamic analysis, identifying vulnerabilities, and crafting exploits. Runtime: 30 minutes."
    }
  ],
  
  "contact": {
    "email": "kushagra.17992@sakec.ac.in",
    "github": "https://github.com/Kushiro45",
    "linkedin": "https://www.linkedin.com/in/kushagra-tiwari-8b942028b/"
  }
}